20201225161440-common_lisp.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-03-04 Thu 10:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Common Lisp</title>
<meta name="generator" content="Org mode">
<link rel="shortcut icon" href="/wiki/static/img/favicon.ico">
<link rel="preconnect" href="https://fonts.gstatic.com">
<link href="https://fonts.googleapis.com/css2?family=Noto+Sans+SC&family=JetBrains+Mono&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/wiki/static/css/style.css">
</head>
<body>
<div id="content">
<header>
<h1 class="title">Common Lisp</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8ece2ba">1. Notes</a>
<ul>
<li><a href="#org1ef1e0f">1.1. On Embedding Python in Common Lisp (Archived)</a></li>
<li><a href="#orga763e42">1.2. On Scientific Computing</a></li>
<li><a href="#org9b7777f">1.3. Gray Streams</a></li>
</ul>
</li>
<li><a href="#org86d6cd5">2. Resources</a>
<ul>
<li><a href="#org56ec3e6">2.1. Articles</a></li>
<li><a href="#org1be77a1">2.2. Papers</a>
<ul>
<li><a href="#org3902806">2.2.1. Compiler</a></li>
<li><a href="#org74a50ea">2.2.2. CLOS</a></li>
<li><a href="#orgef33962">2.2.3. Scientific Computing</a></li>
</ul>
</li>
<li><a href="#orgce3fd32">2.3. Libraries</a>
<ul>
<li><a href="#org0b7585a">2.3.1. Temperance</a></li>
<li><a href="#org4d37469">2.3.2. Screamer</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
Common Lisp is a dialect of the <a href="20201225161334-lisp.html">Lisp</a> programming language, published in <a href="https://en.wikipedia.org/wiki/American_National_Standards_Institute">ANSI</a> standard document ANSI INCITS 226-1994 [S2008] (formerly X3.226-1994 (R1999)).
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">hello-world</span> ()
  (format t <span style="font-style: italic;">"Hello World!~%"</span>))
</pre>
</div>
