org/20201225161440-common_lisp.org
** On Embedding Python in Common Lisp (Archived)

I did look into the interface code over the weekend. It’s not hard to link to the python library but it’s not immediately obvious how to invoke functions in the interpreter.

I did some google searches and found an example of someone loading in a python program and running a function.

I made his program work in Lisp (see the function test at the end) and added support to call the necessary functions in Python.

In the example he had this file filter.py in the current directory:

#+BEGIN_SRC python
def filterFunc(s): return s.upper()
#+END_SRC

and here’s all you need to call that from a lisp program. Note that on my machine the python library is version2.7. On your machine you may need to load in a different so file depending on which Python you’re running.

For a complete interface there are many more Python C/API functions to declare. But I think for most cases just a few key functions will be used.

#+BEGIN_SRC lisp -n
(defpackage :user (:use :ff))
(in-package :user)

(load "/usr/lib64/libpython2.7.so")

;; initialize

(def-foreign-call Py_Initialize (:void) :returning :int)
(def-foreign-call Py_GetVersion (:void) :returning ((* :char)) :strings-convert t)

;; reference count
(def-foreign-call Py_IncRef((object (* :void))) :returning :int)
(def-foreign-call Py_DecRef((object (* :void))) :returning :int)
(def-foreign-call PySys_GetObject ((name (* :char))) :returning ((* void)) :strings-convert t)

;; calling function in the **main** module
(def-foreign-call PyEval_GetGlobals (:void) :returning ((* :void)) :strings-convert t)
(def-foreign-call PyRun_SimpleString((str (* :char))) :returning :int :strings-convert t)
(def-foreign-call Py_GetVersion (:void) :returning ((* :char)) :strings-convert t)
(defconstant Py_single_input 256)
(defconstant Py_file_input 257)
(defconstant Py_eval_input 258)
(def-foreign-call PyRun_String((str (* :char)) (start :int) (globals (* :void)) (locals (* :void))) :returning ((* :void)) :strings-convert t)
(def-foreign-call Py_CompileString((str (* :char)) (filename (* :char)) (kind-of-compile :int)) :returning ((* :void)) :strings-convert t )
(def-foreign-call PyEval_EvalCode((codepointer (* :void)) (globals (* :void)) (locals (* :void))) :returning ((* :void)))
(def-foreign-call PyImport_Import ((stringobject (* :void))) :returning ((* :void)) ; module object )

; allow for any number of args
(def-foreign-call Py_BuildValue () :returning ((* :void)) :strings-convert t)

(def-foreign-call PyObject_GetAttrString((mod (* :void)) (name (* :char))) :returning ((* :void)) :strings-convert t)

(def-foreign-call PyObject_CallObject ((fcnptr (* :void)) (argsobj (* :void))) :returning ((* :void)))

;; objects

; returns pointer to object

(def-foreign-call PyInt_FromLong ((val :long)) :returning ((* void)))

(def-foreign-call PyString_FromString ((val (* :char))) :returning ((* :void)) :strings-convert t)

(def-foreign-call PyString_AsString ((obj (* :void))) :returning ((* :char)) :strings-convert t)

(def-foreign-variable PyType_Type :type :unsigned-long)
(def-foreign-variable PyInt_Type :type :unsigned-long)

(def-foreign-call PyType_Check ((obj (* :void))) :returning :int)

(def-foreign-call PyInt_Check ((obj (* :void))) :returning :int )

(def-foreign-call PyInt_AsLong ((obj (* :void))) :returning :long )

(def-foreign-call PyList_Append ((listobj (* :void)) (object (* :void))) :returning ((* :void)))

(defun test () (Py_Initialize) ; add "." to the sys.path so we can import [filter.py](http://filter.py/) ; in the current directory (let ((syspath (PySys_GetObject "path"))) (PyList_Append syspath (PyString_FromString ".")) )

(let (modobject args fcnptr resobj)
; import [filter.py](http://filter.py/) (setq modobject (PyImport_Import (PyString_FromString "filter")))
; built the argument vector to send to the function in [filter.py](http://filter.py/) (setq args (Py_BuildValue "(s)" "Sample value"))
; find the function filterFunc in the module (setq fcnptr (PyObject_GetAttrString modobject "filterFunc"))

(Py_DecRef modobject) ; call the function on the arguments (setq resobj (PyObject_CallObject fcnptr args)) (Py_DecRef fcnptr) (Py_DecRef args)

; and return the result which will be the given string ; converted to upper case

(let ((ans (PyString_AsString resobj))) (Py_DecRef resobj) ans)))

(def-foreign-call Py_GetVersion (:void) :returning ((* :char)) :strings-convert t)

;; reference count

(def-foreign-call Py_IncRef((object (* :void))) :returning :int)

(def-foreign-call Py_DecRef((object (* :void))) :returning :int)

(def-foreign-call PySys_GetObject ((name (* :char))) :returning ((* void)) :strings-convert t)

;; calling function in the **main** module

(def-foreign-call PyEval_GetGlobals (:void) :returning ((* :void)) :strings-convert t)

(def-foreign-call PyRun_SimpleString((str (* :char))) :returning :int :strings-convert t)

(defconstant Py_single_input 256)
(defconstant Py_file_input 257)
(defconstant Py_eval_input 258)

(def-foreign-call PyRun_String((str (* :char)) (start :int) (globals (* :void)) (locals (* :void))) :returning ((* :void)) :strings-convert t)

(def-foreign-call Py_CompileString((str (* :char)) (filename (* :char)) (kind-of-compile :int)) :returning ((* :void)) :strings-convert t )

(def-foreign-call PyEval_EvalCode((codepointer (* :void)) (globals (* :void)) (locals (* :void))) :returning ((* :void)))

(def-foreign-call PyImport_Import ((stringobject (* :void))) :returning ((* :void)) ; module object )

; allow for any number of args
(def-foreign-call Py_BuildValue () :returning ((* :void)) :strings-convert t)

(def-foreign-call PyObject_GetAttrString((mod (* :void)) (name (* :char))) :returning ((* :void)) :strings-convert t)

(def-foreign-call PyObject_CallObject ((fcnptr (* :void)) (argsobj (* :void))) :returning ((* :void)))

;; objects

; returns pointer to object

(def-foreign-call PyInt_FromLong ((val :long)) :returning ((* void)))

(def-foreign-call PyString_FromString ((val (* :char))) :returning ((* :void)) :strings-convert t)

(def-foreign-call PyString_AsString ((obj (* :void))) :returning ((* :char)) :strings-convert t)

(def-foreign-variable PyType_Type :type :unsigned-long)
(def-foreign-variable PyInt_Type :type :unsigned-long)

(def-foreign-call PyType_Check ((obj (* :void))) :returning :int)

(def-foreign-call PyInt_Check ((obj (* :void))) :returning :int )

(def-foreign-call PyInt_AsLong ((obj (* :void))) :returning :long )

(def-foreign-call PyList_Append ((listobj (* :void)) (object (* :void))) :returning ((* :void)))

(defun test () (Py_Initialize) ; add "." to the sys.path so we can import [filter.py](http://filter.py/) ; in the current directory (let ((syspath (PySys_GetObject "path"))) (PyList_Append syspath (PyString_FromString ".")) )

(let (modobject args fcnptr resobj) ; import [filter.py](http://filter.py/) (setq modobject (PyImport_Import (PyString_FromString "filter")))

; built the argument vector to send to the function in [filter.py](http://filter.py/) (setq args (Py_BuildValue "(s)" "Sample value"))

; find the function filterFunc in the module (setq fcnptr (PyObject_GetAttrString modobject "filterFunc"))

(Py_DecRef modobject) ; call the function on the arguments (setq resobj (PyObject_CallObject fcnptr args)) (Py_DecRef fcnptr) (Py_DecRef args)

; and return the result which will be the given string ; converted to upper case

(let ((ans (PyString_AsString resobj))) (Py_DecRef resobj) ans)))
#+END_SRC

