20201225161440-common_lisp.html


<div id="outline-container-org8ece2ba" class="outline-2">
<h2 id="org8ece2ba"><span class="section-number-2">1</span> Notes</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1ef1e0f" class="outline-3">
<h3 id="org1ef1e0f"><span class="section-number-3">1.1</span> On Embedding Python in Common Lisp (Archived)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
I did look into the interface code over the weekend. It’s not hard to link to the python library but it’s not immediately obvious how to invoke functions in the interpreter.
</p>

<p>
I did some google searches and found an example of someone loading in a python program and running a function.
</p>

<p>
I made his program work in Lisp (see the function test at the end) and added support to call the necessary functions in Python.
</p>

<p>
In the example he had this file filter.py in the current directory:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">filterFunc</span>(s): <span style="font-weight: bold;">return</span> s.upper()
</pre>
</div>

<p>
and here’s all you need to call that from a lisp program. Note that on my machine the python library is version2.7. On your machine you may need to load in a different so file depending on which Python you’re running.
</p>

<p>
For a complete interface there are many more Python C/API functions to declare. But I think for most cases just a few key functions will be used.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="linenr">  1: </span>(<span style="font-weight: bold;">defpackage</span> <span style="font-weight: bold; text-decoration: underline;">:user</span> (<span style="font-weight: bold;">:use</span> <span style="font-weight: bold;">:ff</span>))
<span class="linenr">  2: </span>(<span style="font-weight: bold;">in-package</span> <span style="font-weight: bold;">:user</span>)
<span class="linenr">  3: </span>
<span class="linenr">  4: </span>(load <span style="font-style: italic;">"/usr/lib64/libpython2.7.so"</span>)
<span class="linenr">  5: </span>
<span class="linenr">  6: </span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">initialize</span>
<span class="linenr">  7: </span>
<span class="linenr">  8: </span>(def-foreign-call Py_Initialize (<span style="font-weight: bold;">:void</span>) <span style="font-weight: bold;">:returning</span> <span style="font-weight: bold;">:int</span>)
<span class="linenr">  9: </span>(def-foreign-call Py_GetVersion (<span style="font-weight: bold;">:void</span>) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:char</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 10: </span>
<span class="linenr"> 11: </span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">reference count</span>
<span class="linenr"> 12: </span>(def-foreign-call Py_IncRef((object (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> <span style="font-weight: bold;">:int</span>)
<span class="linenr"> 13: </span>(def-foreign-call Py_DecRef((object (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> <span style="font-weight: bold;">:int</span>)
<span class="linenr"> 14: </span>(def-foreign-call PySys_GetObject ((name (* <span style="font-weight: bold;">:char</span>))) <span style="font-weight: bold;">:returning</span> ((* void)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 15: </span>
<span class="linenr"> 16: </span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">calling function in the **main** module</span>
<span class="linenr"> 17: </span>(def-foreign-call PyEval_GetGlobals (<span style="font-weight: bold;">:void</span>) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 18: </span>(def-foreign-call PyRun_SimpleString((str (* <span style="font-weight: bold;">:char</span>))) <span style="font-weight: bold;">:returning</span> <span style="font-weight: bold;">:int</span> <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 19: </span>(def-foreign-call Py_GetVersion (<span style="font-weight: bold;">:void</span>) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:char</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 20: </span>(<span style="font-weight: bold;">defconstant</span> <span style="font-weight: bold; font-style: italic;">Py_single_input</span> 256)
<span class="linenr"> 21: </span>(<span style="font-weight: bold;">defconstant</span> <span style="font-weight: bold; font-style: italic;">Py_file_input</span> 257)
<span class="linenr"> 22: </span>(<span style="font-weight: bold;">defconstant</span> <span style="font-weight: bold; font-style: italic;">Py_eval_input</span> 258)
<span class="linenr"> 23: </span>(def-foreign-call PyRun_String((str (* <span style="font-weight: bold;">:char</span>)) (start <span style="font-weight: bold;">:int</span>) (globals (* <span style="font-weight: bold;">:void</span>)) (locals (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 24: </span>(def-foreign-call Py_CompileString((str (* <span style="font-weight: bold;">:char</span>)) (filename (* <span style="font-weight: bold;">:char</span>)) (kind-of-compile <span style="font-weight: bold;">:int</span>)) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold;">:strings-convert</span> t )
<span class="linenr"> 25: </span>(def-foreign-call PyEval_EvalCode((codepointer (* <span style="font-weight: bold;">:void</span>)) (globals (* <span style="font-weight: bold;">:void</span>)) (locals (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)))
<span class="linenr"> 26: </span>(def-foreign-call PyImport_Import ((stringobject (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold; font-style: italic;">; module object )</span>
<span class="linenr"> 27: </span>
<span class="linenr"> 28: </span><span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">allow for any number of args</span>
<span class="linenr"> 29: </span>(def-foreign-call Py_BuildValue () <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 30: </span>
<span class="linenr"> 31: </span>(def-foreign-call PyObject_GetAttrString((mod (* <span style="font-weight: bold;">:void</span>)) (name (* <span style="font-weight: bold;">:char</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 32: </span>
<span class="linenr"> 33: </span>(def-foreign-call PyObject_CallObject ((fcnptr (* <span style="font-weight: bold;">:void</span>)) (argsobj (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)))
<span class="linenr"> 34: </span>
<span class="linenr"> 35: </span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">objects</span>
<span class="linenr"> 36: </span>
<span class="linenr"> 37: </span><span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">returns pointer to object</span>
<span class="linenr"> 38: </span>
<span class="linenr"> 39: </span>(def-foreign-call PyInt_FromLong ((val <span style="font-weight: bold;">:long</span>)) <span style="font-weight: bold;">:returning</span> ((* void)))
<span class="linenr"> 40: </span>
<span class="linenr"> 41: </span>(def-foreign-call PyString_FromString ((val (* <span style="font-weight: bold;">:char</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 42: </span>
<span class="linenr"> 43: </span>(def-foreign-call PyString_AsString ((obj (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:char</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 44: </span>
<span class="linenr"> 45: </span>(def-foreign-variable PyType_Type <span style="font-weight: bold;">:type</span> <span style="font-weight: bold;">:unsigned-long</span>)
<span class="linenr"> 46: </span>(def-foreign-variable PyInt_Type <span style="font-weight: bold;">:type</span> <span style="font-weight: bold;">:unsigned-long</span>)
<span class="linenr"> 47: </span>
<span class="linenr"> 48: </span>(def-foreign-call PyType_Check ((obj (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> <span style="font-weight: bold;">:int</span>)
<span class="linenr"> 49: </span>
<span class="linenr"> 50: </span>(def-foreign-call PyInt_Check ((obj (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> <span style="font-weight: bold;">:int</span> )
<span class="linenr"> 51: </span>
<span class="linenr"> 52: </span>(def-foreign-call PyInt_AsLong ((obj (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> <span style="font-weight: bold;">:long</span> )
<span class="linenr"> 53: </span>
<span class="linenr"> 54: </span>(def-foreign-call PyList_Append ((listobj (* <span style="font-weight: bold;">:void</span>)) (object (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)))
<span class="linenr"> 55: </span>
<span class="linenr"> 56: </span>(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">test</span> () (Py_Initialize) <span style="font-weight: bold; font-style: italic;">; add "." to the sys.path so we can import [filter.py](http://filter.py/) ; in the current directory (let ((syspath (PySys_GetObject "path"))) (PyList_Append syspath (PyString_FromString ".")) )</span>
<span class="linenr"> 57: </span>
<span class="linenr"> 58: </span>(<span style="font-weight: bold;">let</span> (modobject args fcnptr resobj)
<span class="linenr"> 59: </span><span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">import [filter.py](http://filter.py/) (setq modobject (PyImport_Import (PyString_FromString "filter")))</span>
<span class="linenr"> 60: </span><span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">built the argument vector to send to the function in [filter.py](http://filter.py/) (setq args (Py_BuildValue "(s)" "Sample value"))</span>
<span class="linenr"> 61: </span><span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">find the function filterFunc in the module (setq fcnptr (PyObject_GetAttrString modobject "filterFunc"))</span>
<span class="linenr"> 62: </span>
<span class="linenr"> 63: </span>(Py_DecRef modobject) <span style="font-weight: bold; font-style: italic;">; call the function on the arguments (setq resobj (PyObject_CallObject fcnptr args)) (Py_DecRef fcnptr) (Py_DecRef args)</span>
<span class="linenr"> 64: </span>
<span class="linenr"> 65: </span><span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">and return the result which will be the given string ; converted to upper case</span>
<span class="linenr"> 66: </span>
<span class="linenr"> 67: </span>(<span style="font-weight: bold;">let</span> ((ans (PyString_AsString resobj))) (Py_DecRef resobj) ans)))
<span class="linenr"> 68: </span>
<span class="linenr"> 69: </span>(def-foreign-call Py_GetVersion (<span style="font-weight: bold;">:void</span>) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:char</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 70: </span>
<span class="linenr"> 71: </span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">reference count</span>
<span class="linenr"> 72: </span>
<span class="linenr"> 73: </span>(def-foreign-call Py_IncRef((object (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> <span style="font-weight: bold;">:int</span>)
<span class="linenr"> 74: </span>
<span class="linenr"> 75: </span>(def-foreign-call Py_DecRef((object (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> <span style="font-weight: bold;">:int</span>)
<span class="linenr"> 76: </span>
<span class="linenr"> 77: </span>(def-foreign-call PySys_GetObject ((name (* <span style="font-weight: bold;">:char</span>))) <span style="font-weight: bold;">:returning</span> ((* void)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 78: </span>
<span class="linenr"> 79: </span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">calling function in the **main** module</span>
<span class="linenr"> 80: </span>
<span class="linenr"> 81: </span>(def-foreign-call PyEval_GetGlobals (<span style="font-weight: bold;">:void</span>) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 82: </span>
<span class="linenr"> 83: </span>(def-foreign-call PyRun_SimpleString((str (* <span style="font-weight: bold;">:char</span>))) <span style="font-weight: bold;">:returning</span> <span style="font-weight: bold;">:int</span> <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 84: </span>
<span class="linenr"> 85: </span>(<span style="font-weight: bold;">defconstant</span> <span style="font-weight: bold; font-style: italic;">Py_single_input</span> 256)
<span class="linenr"> 86: </span>(<span style="font-weight: bold;">defconstant</span> <span style="font-weight: bold; font-style: italic;">Py_file_input</span> 257)
<span class="linenr"> 87: </span>(<span style="font-weight: bold;">defconstant</span> <span style="font-weight: bold; font-style: italic;">Py_eval_input</span> 258)
<span class="linenr"> 88: </span>
<span class="linenr"> 89: </span>(def-foreign-call PyRun_String((str (* <span style="font-weight: bold;">:char</span>)) (start <span style="font-weight: bold;">:int</span>) (globals (* <span style="font-weight: bold;">:void</span>)) (locals (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 90: </span>
<span class="linenr"> 91: </span>(def-foreign-call Py_CompileString((str (* <span style="font-weight: bold;">:char</span>)) (filename (* <span style="font-weight: bold;">:char</span>)) (kind-of-compile <span style="font-weight: bold;">:int</span>)) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold;">:strings-convert</span> t )
<span class="linenr"> 92: </span>
<span class="linenr"> 93: </span>(def-foreign-call PyEval_EvalCode((codepointer (* <span style="font-weight: bold;">:void</span>)) (globals (* <span style="font-weight: bold;">:void</span>)) (locals (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)))
<span class="linenr"> 94: </span>
<span class="linenr"> 95: </span>(def-foreign-call PyImport_Import ((stringobject (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold; font-style: italic;">; module object )</span>
<span class="linenr"> 96: </span>
<span class="linenr"> 97: </span><span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">allow for any number of args</span>
<span class="linenr"> 98: </span>(def-foreign-call Py_BuildValue () <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr"> 99: </span>
<span class="linenr">100: </span>(def-foreign-call PyObject_GetAttrString((mod (* <span style="font-weight: bold;">:void</span>)) (name (* <span style="font-weight: bold;">:char</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr">101: </span>
<span class="linenr">102: </span>(def-foreign-call PyObject_CallObject ((fcnptr (* <span style="font-weight: bold;">:void</span>)) (argsobj (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)))
<span class="linenr">103: </span>
<span class="linenr">104: </span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">objects</span>
<span class="linenr">105: </span>
<span class="linenr">106: </span><span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">returns pointer to object</span>
<span class="linenr">107: </span>
<span class="linenr">108: </span>(def-foreign-call PyInt_FromLong ((val <span style="font-weight: bold;">:long</span>)) <span style="font-weight: bold;">:returning</span> ((* void)))
<span class="linenr">109: </span>
<span class="linenr">110: </span>(def-foreign-call PyString_FromString ((val (* <span style="font-weight: bold;">:char</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr">111: </span>
<span class="linenr">112: </span>(def-foreign-call PyString_AsString ((obj (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:char</span>)) <span style="font-weight: bold;">:strings-convert</span> t)
<span class="linenr">113: </span>
<span class="linenr">114: </span>(def-foreign-variable PyType_Type <span style="font-weight: bold;">:type</span> <span style="font-weight: bold;">:unsigned-long</span>)
<span class="linenr">115: </span>(def-foreign-variable PyInt_Type <span style="font-weight: bold;">:type</span> <span style="font-weight: bold;">:unsigned-long</span>)
<span class="linenr">116: </span>
<span class="linenr">117: </span>(def-foreign-call PyType_Check ((obj (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> <span style="font-weight: bold;">:int</span>)
<span class="linenr">118: </span>
<span class="linenr">119: </span>(def-foreign-call PyInt_Check ((obj (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> <span style="font-weight: bold;">:int</span> )
<span class="linenr">120: </span>
<span class="linenr">121: </span>(def-foreign-call PyInt_AsLong ((obj (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> <span style="font-weight: bold;">:long</span> )
<span class="linenr">122: </span>
<span class="linenr">123: </span>(def-foreign-call PyList_Append ((listobj (* <span style="font-weight: bold;">:void</span>)) (object (* <span style="font-weight: bold;">:void</span>))) <span style="font-weight: bold;">:returning</span> ((* <span style="font-weight: bold;">:void</span>)))
<span class="linenr">124: </span>
<span class="linenr">125: </span>(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">test</span> () (Py_Initialize) <span style="font-weight: bold; font-style: italic;">; add "." to the sys.path so we can import [filter.py](http://filter.py/) ; in the current directory (let ((syspath (PySys_GetObject "path"))) (PyList_Append syspath (PyString_FromString ".")) )</span>
<span class="linenr">126: </span>
<span class="linenr">127: </span>(<span style="font-weight: bold;">let</span> (modobject args fcnptr resobj) <span style="font-weight: bold; font-style: italic;">; import [filter.py](http://filter.py/) (setq modobject (PyImport_Import (PyString_FromString "filter")))</span>
<span class="linenr">128: </span>
<span class="linenr">129: </span><span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">built the argument vector to send to the function in [filter.py](http://filter.py/) (setq args (Py_BuildValue "(s)" "Sample value"))</span>
<span class="linenr">130: </span>
<span class="linenr">131: </span><span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">find the function filterFunc in the module (setq fcnptr (PyObject_GetAttrString modobject "filterFunc"))</span>
<span class="linenr">132: </span>
<span class="linenr">133: </span>(Py_DecRef modobject) <span style="font-weight: bold; font-style: italic;">; call the function on the arguments (setq resobj (PyObject_CallObject fcnptr args)) (Py_DecRef fcnptr) (Py_DecRef args)</span>
<span class="linenr">134: </span>
<span class="linenr">135: </span><span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">and return the result which will be the given string ; converted to upper case</span>
<span class="linenr">136: </span>
<span class="linenr">137: </span>(<span style="font-weight: bold;">let</span> ((ans (PyString_AsString resobj))) (Py_DecRef resobj) ans)))
</pre>
</div>
</div>
</div>
