org/20201225161440-common_lisp.org
** On Scientific Computing

<2018-07-04 Wed, 20:10:45>

About 2 months ago, I started trying to develop an experimental [[https://github.com/macdavid313/Chenyi][mathematics library]] for Common Lisp and today I realize I haven’t touched the code base for a while. The project itself seems to be a failure, however, now I have gained more experience and insights for numerical code written in Common Lisp.

The motivation at the beginning is rather straightforward — to achieve better performance, portability, and generality. Most numerical code require knowledge of algorithms and especially machine-specific properties, e.g. precision. For such a high-level language like Common Lisp, I have found the cost for abstractions is considerably high and actually ubiquitous. Most Common Lisp programmers do know how to optimize code by adding declarations, however, sometimes it is impossible to achieve the very ideal optimization due to the dynamic nature of Lisp. For example, consider this piece of code:

#+BEGIN_SRC lisp
(defun add1 (x)
  (declare (double-float x)
           (optimize speed (safety 0) (space 0)))
  (the double-float (+ 1d0 x)))
#+END_SRC

When one compiles it in SBCL, it will report:

#+BEGIN_SRC text
doing float to pointer coercion (cost 13) to "<return value>"
#+END_SRC

The problem here is, since Common Lisp is dynamically typed, the return value of a function has to include the type information. As what I remember, the type tag in most implementations is stored in the low-order bits of a value. Of course, one way to solve this is by adding another declaration: ~(declaim (inline add1))~. But you definitely will not like to do it for every function, let alone for recursive functions it will probably fail to optimize. Therefore, people choose to call C functions through the foreign function interface for better performance, but it is perhaps not always a welcome solution if one’s programming on Windows.

On the other hand, the standard of Common Lisp doesn’t specify the values of Infinity and NaN (not a number) but rather provides conditions like [[http://www.lispworks.com/documentation/HyperSpec/Body/e_floa_2.htm#floating-point-overflow][floating-point-overflow]] to handle arithmetic errors. I did take some [[https://github.com/macdavid313/Chenyi/blob/master/src/constants.lisp#L88][efforts]] to make Infinities and NaNs portably available on most implementations, however, there are minor problems on ECL, CMUCL, and the Windows platform.

Last but not the least, I want to mention the library [[https://github.com/cosmos72/cl-parametric-types][cl-parametric-types]] if one wants to write generic code in a “special” dimension. I have made a [[https://github.com/cosmos72/cl-parametric-types/pull/7][pull request]] which makes the library also functional on AllegroCL, ECL and LispWorks besides others. For a simple use case, consider the add1 function shown above, by using cl-parametric-types, we may write it like this:

#+BEGIN_SRC lisp
(template (<t>)
  (defun add1 (x)
    (declare (type <t> x)
             (optimize speed (safety 0) (space 0)))
    (the <t> (+ (float 1 x) x))))
#+END_SRC

After compilation, you will get a macro ~add1~:

#+BEGIN_SRC lisp
CL-USER> (add1 (single-float) 1f0)
; instantiating template-function (ADD1 SINGLE-FLOAT)
;   as ADD1-SINGLE-FLOAT
2.0
CL-USER> (add1 (double-float) 1d0)
; instantiating template-function (ADD1 DOUBLE-FLOAT)
;   as ADD1-DOUBLE-FLOAT
2.0d0
CL-USER> (disassemble 'add1-single-float)
; disassembly for ADD1-SINGLE-FLOAT
; Size: 33 bytes. Origin: #x1003B88BDB
; DB:       84042500001020   TEST AL, [#x20100000]            ; no-arg-parsing entry point
                                                              ; safepoint
; E2:       F30F580D96FFFFFF ADDSS XMM1, [RIP-106]            ; [#x1003B88B80]
; EA:       660F7ECA         MOVD EDX, XMM1
; EE:       48C1E220         SHL RDX, 32
; F2:       4883CA19         OR RDX, 25
; F6:       488BE5           MOV RSP, RBP
; F9:       F8               CLC
; FA:       5D               POP RBP
; FB:       C3               RET
NIL
#+END_SRC

To conclude, my experimental process is a success but the project may be considered a failure in the end. It simply requires too much work to resolve performance, portability, and generality at the same time, the complexity of it will become much worse and thus compromises will be unavoidable in the cases like linear algebra. In the past, there were a lot of smart people who tried to implement efficient mathematics libraries for Common Lisp. We have many experiences and insights to share with each other, but we must admit that non-trivial numerical code written in Common Lisp is honestly hard to be fairly perfect.

See (read) more information of this topic here: [[*Scientific Computing][Scientific Computing]].

** Gray Streams

<2020-12-26 Sat 17:31>

CLiki link: [[https://www.cliki.net/Gray%20streams]]

"Gray Streams" are a generic function wrapping of the COMMON-LISP streams in the standard library, allowing for further specialization by end-users. This interface was proposed for inclusion with ANSI CL by David N. Gray in Issue STREAM-DEFINITION-BY-USER(http://www.nhplace.com/kent/CL/Issues/stream-definition-by-user.html). The proposal did not make it into ANSI CL, but most popular CL implementations implement this facility anyway.

