20201225161440-common_lisp.html

<div id="outline-container-orga763e42" class="outline-3">
<h3 id="orga763e42"><span class="section-number-3">1.2</span> On Scientific Computing</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2018-07-04 Wed 20:10]</span></span>
</p>

<p>
About 2 months ago, I started trying to develop an experimental <a href="https://github.com/macdavid313/Chenyi">mathematics library</a> for Common Lisp and today I realize I haven’t touched the code base for a while. The project itself seems to be a failure, however, now I have gained more experience and insights for numerical code written in Common Lisp.
</p>

<p>
The motivation at the beginning is rather straightforward — to achieve better performance, portability, and generality. Most numerical code require knowledge of algorithms and especially machine-specific properties, e.g. precision. For such a high-level language like Common Lisp, I have found the cost for abstractions is considerably high and actually ubiquitous. Most Common Lisp programmers do know how to optimize code by adding declarations, however, sometimes it is impossible to achieve the very ideal optimization due to the dynamic nature of Lisp. For example, consider this piece of code:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">add1</span> (x)
  (<span style="font-weight: bold;">declare</span> (double-float x)
           (optimize speed (safety 0) (space 0)))
  (<span style="font-weight: bold;">the</span> double-float (+ 1d0 x)))
</pre>
</div>

<p>
When one compiles it in SBCL, it will report:
</p>

<div class="org-src-container">
<pre class="src src-text">doing float to pointer coercion (cost 13) to "&lt;return value&gt;"
</pre>
</div>

<p>
The problem here is, since Common Lisp is dynamically typed, the return value of a function has to include the type information. As what I remember, the type tag in most implementations is stored in the low-order bits of a value. Of course, one way to solve this is by adding another declaration: <code>(declaim (inline add1))</code>. But you definitely will not like to do it for every function, let alone for recursive functions it will probably fail to optimize. Therefore, people choose to call C functions through the foreign function interface for better performance, but it is perhaps not always a welcome solution if one’s programming on Windows.
</p>

<p>
On the other hand, the standard of Common Lisp doesn’t specify the values of Infinity and NaN (not a number) but rather provides conditions like <a href="http://www.lispworks.com/documentation/HyperSpec/Body/e_floa_2.htm#floating-point-overflow">floating-point-overflow</a> to handle arithmetic errors. I did take some <a href="https://github.com/macdavid313/Chenyi/blob/master/src/constants.lisp#L88">efforts</a> to make Infinities and NaNs portably available on most implementations, however, there are minor problems on ECL, CMUCL, and the Windows platform.
</p>

<p>
Last but not the least, I want to mention the library <a href="https://github.com/cosmos72/cl-parametric-types">cl-parametric-types</a> if one wants to write generic code in a “special” dimension. I have made a <a href="https://github.com/cosmos72/cl-parametric-types/pull/7">pull request</a> which makes the library also functional on AllegroCL, ECL and LispWorks besides others. For a simple use case, consider the add1 function shown above, by using cl-parametric-types, we may write it like this:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(template (&lt;t&gt;)
  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">add1</span> (x)
    (<span style="font-weight: bold;">declare</span> (type &lt;t&gt; x)
             (optimize speed (safety 0) (space 0)))
    (<span style="font-weight: bold;">the</span> &lt;t&gt; (+ (float 1 x) x))))
</pre>
</div>

<p>
After compilation, you will get a macro <code>add1</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp">CL-USER&gt; (add1 (single-float) 1f0)
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">instantiating template-function (ADD1 SINGLE-FLOAT)</span>
<span style="font-weight: bold; font-style: italic;">;   </span><span style="font-weight: bold; font-style: italic;">as ADD1-SINGLE-FLOAT</span>
2.0
CL-USER&gt; (add1 (double-float) 1d0)
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">instantiating template-function (ADD1 DOUBLE-FLOAT)</span>
<span style="font-weight: bold; font-style: italic;">;   </span><span style="font-weight: bold; font-style: italic;">as ADD1-DOUBLE-FLOAT</span>
2.0d0
CL-USER&gt; (disassemble 'add1-single-float)
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">disassembly for ADD1-SINGLE-FLOAT</span>
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Size: 33 bytes. Origin: #x1003B88BDB</span>
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">DB:       84042500001020   TEST AL, [#x20100000]            ; no-arg-parsing entry point</span>
                                                              <span style="font-weight: bold; font-style: italic;">; safepoint</span>
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">E2:       F30F580D96FFFFFF ADDSS XMM1, [RIP-106]            ; [#x1003B88B80]</span>
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">EA:       660F7ECA         MOVD EDX, XMM1</span>
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">EE:       48C1E220         SHL RDX, 32</span>
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">F2:       4883CA19         OR RDX, 25</span>
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">F6:       488BE5           MOV RSP, RBP</span>
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">F9:       F8               CLC</span>
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">FA:       5D               POP RBP</span>
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">FB:       C3               RET</span>
NIL
</pre>
</div>

<p>
To conclude, my experimental process is a success but the project may be considered a failure in the end. It simply requires too much work to resolve performance, portability, and generality at the same time, the complexity of it will become much worse and thus compromises will be unavoidable in the cases like linear algebra. In the past, there were a lot of smart people who tried to implement efficient mathematics libraries for Common Lisp. We have many experiences and insights to share with each other, but we must admit that non-trivial numerical code written in Common Lisp is honestly hard to be fairly perfect.
</p>

<p>
See (read) more information of this topic here: <a href="#orgef33962">Scientific Computing</a>.
</p>
</div>
</div>

<div id="outline-container-org9b7777f" class="outline-3">
<h3 id="org9b7777f"><span class="section-number-3">1.3</span> Gray Streams</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-12-26 Sat 17:31]</span></span>
</p>

<p>
CLiki link: <a href="https://www.cliki.net/Gray%20streams">https://www.cliki.net/Gray%20streams</a>
</p>

<p>
"Gray Streams" are a generic function wrapping of the COMMON-LISP streams in the standard library, allowing for further specialization by end-users. This interface was proposed for inclusion with ANSI CL by David N. Gray in Issue STREAM-DEFINITION-BY-USER(<a href="http://www.nhplace.com/kent/CL/Issues/stream-definition-by-user.html">http://www.nhplace.com/kent/CL/Issues/stream-definition-by-user.html</a>). The proposal did not make it into ANSI CL, but most popular CL implementations implement this facility anyway.
</p>
</div>
</div>
</div>
